app/controllers/home_controller.rb

  def index
    @current_user = current_user
    @rooms = Room.all()
---
SELECT "rooms".* FROM "rooms"