app/controllers/room_controller.rb

  def index
    @room = Room.find(params[:key_room])
    @users = User.all()
    @current_user = current_user
    @chats = Chat.select("chats.message, chats.created_at ,users.email as email").joins("LEFT JOIN rooms ON chats.key_room = rooms.id").joins("LEFT JOIN users ON chats.key_user = users.id").where("chats.key_room = ?", params[:key_room])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"
SELECT chats.message, chats.created_at ,users.email as email FROM "chats" LEFT JOIN rooms ON chats.key_room = rooms.id LEFT JOIN users ON chats.key_user = users.id WHERE (chats.key_room = 1)

  def sendThisMessage
    json_params = JSON.parse(request.body.read)
    time_now = Time.now
    formatted_time = time_now.strftime("%Y-%m-%d %H:%M:%S.%6N")
    @chat = Chat.new(key_room: json_params['key_room'], key_user: current_user.id, message: json_params['message'], created_at: time_now, updated_at: time_now)
    if @chat.save
---
INSERT INTO "chats" ("key_room", "key_user", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["key_room", 1], ["key_user", 1], ["message", ""], ["created_at", "2023-03-18 16:09:50.674879"], ["updated_at", "2023-03-18 16:09:50.674879"]]

  def getThisMessage
    @chats = Chat.select("chats.message, chats.created_at ,users.email as email").joins("LEFT JOIN rooms ON chats.key_room = rooms.id").joins("LEFT JOIN users ON chats.key_user = users.id").where("chats.key_room = ?", params[:key_room])
---
SELECT chats.message, chats.created_at ,users.email as email FROM "chats" LEFT JOIN rooms ON chats.key_room = rooms.id LEFT JOIN users ON chats.key_user = users.id WHERE (chats.key_room = '1')